# GetSpaceAtPoint Method (XYZ) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Document..::..GetSpaceAtPoint Method (XYZ)
Document Class See Also
---
Gets a space containing the point.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Space GetSpaceAtPoint(
	XYZ point
)
```

Visual Basic
---
```text
Public Function GetSpaceAtPoint ( _
	point As XYZ _
) As Space
```

Visual C++
---
```text
public:
Space^ GetSpaceAtPoint(
	XYZ^ point
)
```

# ### Parameters
point
    Type: Autodesk.Revit.DB..::..XYZPoint to be checked.
# ### Return Value
The space containing the point.
# Remarks
Surveys only the spaces from the final phase of the project. The first one found will be returned. If there is no space containing the point, it returns nullNothingnullptra null reference (Nothing in Visual Basic).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when the point is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..ArgumentException | Thrown when the coordinates of the point are not number or are Double::MaxValue or Double::MinValue. |

# See Also
Document Class
GetSpaceAtPoint Overload
Autodesk.Revit.DB Namespace